Revit 2024 API
PipingSystem.GetVolume Method
 Gets the volume of this piping system.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double GetVolume()
Visual Basic
Public Function GetVolume As Double
Visual C++
public:
double GetVolume()
Remarks
 The publicly exposed method.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The volume can not be calculated for this system.
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace